In [2]:
# Need to get read the json in the format of the data frame 
import pandas as pd 
from io import StringIO
Data = '{"employee_name" : "Anand" , "email" : "anand@gmail.com" , "Job_Title" : [{"Title 1" : "Team Lead" , "Title 2" : "AI/ML ENgineer"}]}'
df = pd.read_json(StringIO(Data))
df.head()

,employee_name,email,Job_Title
0,Anand,anand@gmail.com,"{'Title 1': 'Team Lead', 'Title 2': 'AI/ML ENg..."

In [3]:
# in order to convert the data to json 
df.to_json()

'{"employee_name":{"0":"Anand"},"email":{"0":"anand@gmail.com"},"Job_Title":{"0":{"Title 1":"Team Lead","Title 2":"AI\\/ML ENgineer"}}}'

In [6]:
# alternate options 
df.to_json(orient='records')

'[{"employee_name":"Anand","email":"anand@gmail.com","Job_Title":{"Title 1":"Team Lead","Title 2":"AI\\/ML ENgineer"}}]'

In [12]:
!pip install html5lib
!pip install beautifulsoup4

Requirement already satisfied: html5lib in /opt/homebrew/anaconda3/lib/python3.11/site-packages (1.1)
Requirement already satisfied: six>=1.9 in /opt/homebrew/anaconda3/lib/python3.11/site-packages (from html5lib) (1.17.0)
Requirement already satisfied: webencodings in /opt/homebrew/anaconda3/lib/python3.11/site-packages (from html5lib) (0.5.1)
Requirement already satisfied: beautifulsoup4 in /opt/homebrew/anaconda3/lib/python3.11/site-packages (4.12.2)
Requirement already satisfied: soupsieve>1.2 in /opt/homebrew/anaconda3/lib/python3.11/site-packages (from beautifulsoup4) (2.5)

In [36]:
# need to get the data from a HTML web page 
url = "https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/"
df = pd.read_html(url , match='State' , header=0)

In [37]:
df[0]

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund Sort ascending
0,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
1,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
2,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
3,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
4,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
5,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
6,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
7,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
8,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
9,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537

In [38]:
url = "https://en.wikipedia.org//wiki/Mobile_country_code"
data_df = pd.read_html(url , match="Country" , header=0)

In [39]:
data_df[0]

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN
...,...,...,...,...,...,...
247,452,Vietnam,VN,List of mobile network codes in the Vietnam,NaN,NaN
248,543,W Wallis and Futuna,WF,List of mobile network codes in Wallis and Futuna,NaN,NaN
249,421,Y Yemen,YE,List of mobile network codes in the Yemen,NaN,NaN
250,645,Z Zambia,ZM,List of mobile network codes in Zambia,NaN,NaN
251,648,Zimbabwe,ZW,List of mobile network codes in Zimbabwe,NaN,NaN

In [40]:
scrap_url = "https://en.wikipedia.org/wiki/Information_technology_in_India"
tables = pd.read_html(scrap_url , match='IT Services Company name' , header=0)

In [43]:
tables[0]

,Rank,IT Services Company name,Market capitalization in 2022(US$ Billion),Market capitalization in 2022(₹ Cr)
0,1,Tata Consultancy Services,200.00,1463372.44
1,2,Infosys,100.00,734140.78
2,3,Wipro,50.00,317428.00
3,4,HCL Technologies,36.67,318061.00
4,5,LTIMindtree,20.86,133592.40
5,6,Tech Mahindra,12.65,133592.40